app/controllers/orders_controller.rb

  def index
    @orders = Order.where(user_id: current_user.id)
---
SELECT `orders`.* FROM `orders` WHERE `orders`.`user_id` = 1

  def create
    @order = Order.new(order_params)
    @order.calculate_total(params[:order][:qty].to_i)
    @order.product.update_quantity(params[:order][:qty].to_i)
    respond_to do |format|
      if @order.save
---
INSERT INTO `orders` (`number`, `user_id`, `state`, `created_at`, `updated_at`, `product_id`) VALUES ('SHQ45334', 1, 'pending', '2019-07-25 16:14:54', '2019-07-25 16:14:54', 4)

  def update
    respond_to do |format|
      if @order.update(order_params)
---
UPDATE `orders` SET `qty` = 5, `updated_at` = '2019-07-26 00:24:55' WHERE `orders`.`id` = 4

  def purchase
    @order = Order.find(params[:id])
---
SELECT  `orders`.* FROM `orders` WHERE `orders`.`id` = 4 LIMIT 1

  def cancel_purchase
    @order = Order.find(params[:id])
---
SELECT  `orders`.* FROM `orders` WHERE `orders`.`id` = 5 LIMIT 1