app/controllers/products_controller.rb

  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save
---
INSERT INTO `products` (`name`, `price`, `created_at`, `updated_at`, `quantity`, `image_file_name`, `image_content_type`, `image_file_size`, `image_updated_at`) VALUES ('Meja', 60000, '2019-07-25 15:26:31', '2019-07-25 15:26:31', 20, 'living-room.png', 'image/png', 1464982, '2019-07-25 15:26:31')

  def update
    respond_to do |format|
      if @product.update(product_params)
---
UPDATE `products` SET `quantity` = 50, `image_file_name` = 'vintage.png', `image_content_type` = 'image/png', `image_file_size` = 185983, `image_updated_at` = '2019-07-25 16:21:32', `updated_at` = '2019-07-25 16:21:32' WHERE `products`.`id` = 3