app/models/order.rb

  def calculate_total(qty)
    self.total = qty * self.product.price
    self.save
---
UPDATE `orders` SET `total` = 180000, `updated_at` = '2019-07-26 00:26:57' WHERE `orders`.`id` = 4
INSERT INTO `orders` (`number`, `qty`, `total`, `user_id`, `state`, `created_at`, `updated_at`, `product_id`) VALUES ('SHQ98999', 1, 90000, 1, 'pending', '2019-07-27 11:55:36', '2019-07-27 11:55:36', 1)

  def generate_number(options = {})
    options[:length]  ||= 5
    options[:letters] ||= false
    options[:prefix]  ||= "SHQ"

    possible = (0..9).to_a
    possible += ('A'..'Z').to_a if options[:letters]
    self.number ||= loop do
      # Make a random number.
      random = "#{options[:prefix]}#{(0...options[:length]).map { possible.sample }.join}"
      # Use the random  number if no other order exists with it.
      if self.class.exists?(number: random)
---
SELECT  1 AS one FROM `orders` WHERE `orders`.`number` = 'SHQ98999' LIMIT 1