app/models/product.rb

  def update_quantity(qty)
    self.quantity = self.quantity - qty
    self.save
---
UPDATE `products` SET `quantity` = 46, `updated_at` = '2019-07-26 00:19:09' WHERE `products`.`id` = 3

  def return_quantity(qty)
    self.quantity = self.quantity + qty
    self.save
---
UPDATE `products` SET `quantity` = 50, `updated_at` = '2019-07-26 07:59:56' WHERE `products`.`id` = 2