app/models/user.rb

  def update_confirmed_at
    self.confirmed_at = Time.now
    self.save
---
UPDATE `users` SET `confirmed_at` = '2019-07-27 12:09:43' WHERE `users`.`id` = 2

  def self.from_omniauth(access_token)
    data = access_token.info
    user = User.where(email: data['email']).first

    # Uncomment the section below if you want users to be created if they don't exist
    unless user
        user = User.create(name: data['name'],
           email: data['email'],
           password: Devise.friendly_token[0,20]
        )
---
SELECT  `users`.* FROM `users` WHERE `users`.`email` = 'thowwafi@gmail.com' ORDER BY `users`.`id` ASC LIMIT 1
INSERT INTO `users` (`uid`, `encrypted_password`, `confirmation_token`, `confirmation_sent_at`, `name`, `email`, `tokens`, `created_at`, `updated_at`) VALUES ('thowwafi@gmail.com', '$2a$11$mwY02x9vx6dfKH9zstzhpu3lk7Qxn4slnrDQhdp16DcBHpdhx1Z.u', 'DaAiC24nL4BXSmpsYN32', '2019-07-27 12:09:43', 'Thowwafi Alfiansyah', 'thowwafi@gmail.com', '{}', '2019-07-27 12:09:43', '2019-07-27 12:09:43')